app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <p>
    What are people saying about <%=@movie.title%>? <%= link_to "Read #{pluralize(@movie.reviews.size, 'Review')} Here", movie_reviews_path(@movie) %>