app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if  @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)